ADNdlc/STM32_CubeIDE/F103/2-3_FreeRTOS_example_0/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED_0_Pin GPIO_PIN_13
#define LED_0_GPIO_Port GPIOC
#define M0_IN1_Pin GPIO_PIN_0
#define M0_IN1_GPIO_Port GPIOA
#define M0_IN2_Pin GPIO_PIN_1
#define M0_IN2_GPIO_Port GPIOA
#define M0_IN3_Pin GPIO_PIN_2
#define M0_IN3_GPIO_Port GPIOA
#define M1_IN1_Pin GPIO_PIN_3
#define M1_IN1_GPIO_Port GPIOA
#define M1_OUT1_CS_Pin GPIO_PIN_4
#define M1_OUT1_CS_GPIO_Port GPIOA
#define M1_IN2_Pin GPIO_PIN_6
#define M1_IN2_GPIO_Port GPIOA
#define M1_IN3_Pin GPIO_PIN_7
#define M1_IN3_GPIO_Port GPIOA
#define M0_OUT1_CS_Pin GPIO_PIN_0
#define M0_OUT1_CS_GPIO_Port GPIOB
#define M0_OUT2_CS_Pin GPIO_PIN_1
#define M0_OUT2_CS_GPIO_Port GPIOB
#define I2C0_SCL_Pin GPIO_PIN_10
#define I2C0_SCL_GPIO_Port GPIOB
#define I2C0_SDA_Pin GPIO_PIN_11
#define I2C0_SDA_GPIO_Port GPIOB
#define MOTOR_EN_Pin GPIO_PIN_8
#define MOTOR_EN_GPIO_Port GPIOA

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
